# **Groupby Function**

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'EmpID': [101,102,103,104,105,106,107,108],
    'Name': ['Ali','Sara','Ahmed','Zara','Usman','Hina','Bilal','Nida'],
    'Dept': ['IT','HR','IT','Finance','HR','IT','HR','Finance'],
    'Salary': [50000,60000,55000,70000,58000,52000,62000,68000],
    'Experience': [2,5,3,7,4,1,6,8]
})

## **`groupby()`** : **Simple (Naive Approach)**

In [3]:
df.groupby('Dept')

In [4]:
# Use Loop to print object
for dept, group in df.groupby('Dept'):
    print(dept)
    print(group)

Finance
   EmpID  Name     Dept  Salary  Experience
3    104  Zara  Finance   70000           7
7    108  Nida  Finance   68000           8
HR
   EmpID   Name Dept  Salary  Experience
1    102   Sara   HR   60000           5
4    105  Usman   HR   58000           4
6    107  Bilal   HR   62000           6
IT
   EmpID   Name Dept  Salary  Experience
0    101    Ali   IT   50000           2
2    103  Ahmed   IT   55000           3
5    106   Hina   IT   52000           1

In [5]:
df.groupby('Dept')[['Salary','Experience']]

### ðŸ”¹`get_group('Group')` **to get group**

In [6]:
df.groupby('Dept').get_group('IT')
df.groupby('Dept').get_group('HR')
df.groupby('Dept').get_group('Finance')

   EmpID  Name     Dept  Salary  Experience
3    104  Zara  Finance   70000           7
7    108  Nida  Finance   68000           8

---
## **`groupby()`** : **With Aggregation (mean, median, sum, max)**

**Syntax Pattern:**
```python
df.groupby('Dept')['Salary'].mean()
```
**Breakdown:**


| Part              | Meaning              |
| ----------------- | -------------------- |
| `groupby('Dept')` | group rows           |
| `['Salary']`      | column to aggregate  |
| `.mean()`         | aggregation function |

In [7]:
df.groupby('Dept')['Salary'].mean()

Dept
Finance    69000.000000
HR         60000.000000
IT         52333.333333
Name: Salary, dtype: float64

### ðŸ”¹  **Multiple Aggregation** ( `agg(['sum','mean','max'])` )

In [8]:
df.groupby('Dept')['Salary'].agg(['mean','median','max','min'])

                 mean   median    max    min
Dept
Finance  69000.000000  69000.0  70000  68000
HR       60000.000000  60000.0  62000  58000
IT       52333.333333  52000.0  55000  50000

### ðŸ”¹  **Multiple Columns** ( `[['Col1','Col2']]` )

In [9]:
df.groupby('Dept')[['Salary','Experience']].mean()

               Salary  Experience
Dept
Finance  69000.000000         7.5
HR       60000.000000         5.0
IT       52333.333333         2.0

### ðŸ”¹  **Custom Column Names ( Named Aggregation )**

**Syntax Structure:**
```python
df.groupby('GroupCol').agg(
    New_Column_Name = ('Source_Column', 'Function_Name')
)
```

In [10]:
df.groupby('Dept').agg(
    AvgSalary=('Salary','mean'),
    MaxExp=('Experience','max')
)

            AvgSalary  MaxExp
Dept
Finance  69000.000000       8
HR       60000.000000       6
IT       52333.333333       3

---
## **`groupby()`** : **With `Transform('mean')`**

> `transform()` returns SAME SIZE as original DataFrame

In [11]:
df.groupby('Dept')['Salary'].transform('mean')

0    52333.333333
1    60000.000000
2    52333.333333
3    69000.000000
4    60000.000000
5    52333.333333
6    60000.000000
7    69000.000000
Name: Salary, dtype: float64

---
## **`groupby()`** : **With `filter()`**

In [ ]:
# df.groupby('Dept').filter(lambda x: x['Salary'].mean() > 60000)
df.groupby('Dept').filter(lambda x : x['Experience'].mean() >2)

   EmpID   Name     Dept  Salary  Experience
1    102   Sara       HR   60000           5
3    104   Zara  Finance   70000           7
4    105  Usman       HR   58000           4
6    107  Bilal       HR   62000           6
7    108   Nida  Finance   68000           8

----

# **Practice Problems**

### Q1. Find average salary per department.

In [19]:
df.groupby('Dept')['Salary'].mean()

Dept
Finance    69000.000000
HR         60000.000000
IT         52333.333333
Name: Salary, dtype: float64

### Q2. Find maximum experience per department.

In [20]:
df.groupby('Dept')['Experience'].max()

Dept
Finance    8
HR         6
IT         3
Name: Experience, dtype: int64

### Q3. Find count of employees per department.

In [ ]:
df.groupby('Dept')['EmpID'].count()
# OR
df.groupby('Dept').size()

Dept
Finance    2
HR         3
IT         3
Name: EmpID, dtype: int64

### Q4. Add a column `DeptAvgSalary` that stores department-wise average salary.

In [ ]:
df['DeptAvgSalary']=df.groupby('Dept')['Salary'].transform('mean')

   EmpID   Name     Dept  Salary  Experience  DeptAvgSalary
0    101    Ali       IT   50000           2   52333.333333
1    102   Sara       HR   60000           5   60000.000000
2    103  Ahmed       IT   55000           3   52333.333333
3    104   Zara  Finance   70000           7   69000.000000
4    105  Usman       HR   58000           4   60000.000000
5    106   Hina       IT   52000           1   52333.333333
6    107  Bilal       HR   62000           6   60000.000000
7    108   Nida  Finance   68000           8   69000.000000

### Q5. Retrieve employees whose salary is above department average.

In [ ]:
df[df['Salary']> df.groupby('Dept')['Salary'].transform('mean')]
# OR
df[df['Salary'] > df['DeptAvgSalary']]

   EmpID   Name     Dept  Salary  Experience  DeptAvgSalary
2    103  Ahmed       IT   55000           3   52333.333333
3    104   Zara  Finance   70000           7   69000.000000
6    107  Bilal       HR   62000           6   60000.000000

### Q6. Add a column `SalaryRank` (rank salary within department, highest = 1)

**Use `rank(ascending=True/False method=defualt/dense)`**

In [51]:
df['SalaryRank']=df.groupby('Dept')['Salary'].rank(ascending=False,method='dense').astype(int)
df

   EmpID   Name     Dept  Salary  Experience  DeptAvgSalary  SalaryRank
0    101    Ali       IT   50000           2   52333.333333           3
1    102   Sara       HR   60000           5   60000.000000           2
2    103  Ahmed       IT   55000           3   52333.333333           1
3    104   Zara  Finance   70000           7   69000.000000           1
4    105  Usman       HR   58000           4   60000.000000           3
5    106   Hina       IT   52000           1   52333.333333           2
6    107  Bilal       HR   62000           6   60000.000000           1
7    108   Nida  Finance   68000           8   69000.000000           2

### Q7. Find departments where **average experience > 5**.

In [84]:
df.groupby('Dept')['Experience'].mean().loc[lambda x:x >5]
# OR
df.groupby('Dept').filter(lambda x : x['Experience'].mean()>5)['Dept'].unique()

array(['Finance'], dtype=object)

### Q8. Retrieve employees belonging to departments having **more than 2 employees**.

In [89]:
df.groupby('Dept').filter(lambda x : x['EmpID'].count() > 2)
# OR
df[df.groupby('Dept')['Dept'].transform('count')>2]

,EmpID,Name,Dept,Salary,Experience,DeptAvgSalary,SalaryRank,AvgDeptExp,NormalizedSalary
1,102,Sara,HR,60000,5,60000.0,2,5.0,12000.0
4,105,Usman,HR,58000,4,60000.0,3,5.0,11600.0
6,107,Bilal,HR,62000,6,60000.0,1,5.0,12400.0

### Q9. Normalize salary within department: `NormalizedSalary = Salary / DeptAvgSalary`

In [68]:
df['NormalizedSalary']=df['Salary']/df['AvgDeptExp']
df

,EmpID,Name,Dept,Salary,Experience,DeptAvgSalary,SalaryRank,AvgDeptExp,NormalizedSalary
0,101,Ali,IT,50000,2,52333.333333,3,2.0,25000.000000
1,102,Sara,HR,60000,5,60000.000000,2,5.0,12000.000000
2,103,Ahmed,IT,55000,3,52333.333333,1,2.0,27500.000000
3,104,Zara,Finance,70000,7,69000.000000,1,7.5,9333.333333
4,105,Usman,HR,58000,4,60000.000000,3,5.0,11600.000000
5,106,Hina,IT,52000,1,52333.333333,2,2.0,26000.000000
6,107,Bilal,HR,62000,6,60000.000000,1,5.0,12400.000000
7,108,Nida,Finance,68000,8,69000.000000,2,7.5,9066.666667

### Q10. Remove departments where **any employee has experience < 2**.

In [76]:
# expertTeams=df.groupby('Dept').filter(lambda x: (x['Experience'] >= 2).all())
expertTeams=df.groupby('Dept').filter(lambda x : not(x['Experience']<2).any())

In [77]:
df

,EmpID,Name,Dept,Salary,Experience,DeptAvgSalary,SalaryRank,AvgDeptExp,NormalizedSalary
0,101,Ali,IT,50000,2,52333.333333,3,2.0,25000.000000
1,102,Sara,HR,60000,5,60000.000000,2,5.0,12000.000000
2,103,Ahmed,IT,55000,3,52333.333333,1,2.0,27500.000000
3,104,Zara,Finance,70000,7,69000.000000,1,7.5,9333.333333
4,105,Usman,HR,58000,4,60000.000000,3,5.0,11600.000000
5,106,Hina,None,52000,1,52333.333333,2,2.0,26000.000000
6,107,Bilal,HR,62000,6,60000.000000,1,5.0,12400.000000
7,108,Nida,Finance,68000,8,69000.000000,2,7.5,9066.666667

In [ ]:
#------------------------------------------------------------------------------------------------------------------------------------------------------------
df.assign(
    DeptAvgSalary=df.groupby('Dept')['Salary'].transform('mean')
)
df.query("Salary > DeptAvgSalary")

,EmpID,Name,Dept,Salary,Experience,DeptAvgSalary,SalaryRank,AvgDeptExp,NormalizedSalary
2,103,Ahmed,IT,55000,3,52333.333333,1,2.0,27500.000000
3,104,Zara,Finance,70000,7,69000.000000,1,7.5,9333.333333
6,107,Bilal,HR,62000,6,60000.000000,1,5.0,12400.000000